Revit 2027 API
DividedSurface.AddIntersectionElement Method
 Adds an intersection element to the divided surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddIntersectionElement(
	ElementId newIntersectionElemId
)
Public Sub AddIntersectionElement (
	newIntersectionElemId As ElementId
)
public:
void AddIntersectionElement(
	ElementId^ newIntersectionElemId
)
member AddIntersectionElement :
        newIntersectionElemId : ElementId -> unit
Parameters
newIntersectionElemId ElementId
 The intersection element to be added.
Exceptions
Exception | Condition
ArgumentException |  The element newIntersectionElemId is not a level, grid, reference plane, or a curve element whose category is lines and reference lines.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace